4.gas-liquid shock tube/compressibleInterFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interTwoPhaseCentralFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         8e-4;//0.002;

deltaT          0.5e-9;

writeControl    adjustable;

writeInterval   8e-4;//1e-3;//0.001;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  true;//false;

maxCo           0.1;
maxAlphaCo      1;

maxDeltaT       2e-7;

functions
{
    sample
    {
    	#include "sampleDict"
    }
}

// ************************************************************************* //
