4.gas-liquid shock tube/compressibleInterFoam/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

defaultAdvScheme     Minmod;
defaultAdvSchemeV    MinmodV;

divSchemes
{
    default none;
    
    div(phirb,alpha)		Gauss vanLeer;
    div(phi,alpha)  		Gauss $defaultAdvScheme;//upwind;
    div(rhoPhi,U)   		Gauss $defaultAdvSchemeV;
    div(rhoPhi,K)   		Gauss $defaultAdvScheme;
    div(phi,p)      		Gauss $defaultAdvScheme;
    div(phid1,p_rgh)      	Gauss $defaultAdvScheme;
    div(phid2,p_rgh)      	Gauss $defaultAdvScheme;
    div(alphaRhoPhi,e) 		Gauss $defaultAdvScheme;
    div(alphaRhoPhi,h) 		Gauss $defaultAdvScheme;
    div(alphaRhoPhi,T) 		Gauss $defaultAdvScheme;
    div(rhoPhi,T) 			Gauss $defaultAdvScheme;
    div(rhoPhi,k)   		Gauss $defaultAdvScheme;
    div(rhoPhi,omega) 		Gauss $defaultAdvScheme;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
