4.gas-liquid shock tube/compressibleInterFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        cAlpha          0;//1;//0, 0.5
        nAlphaCorr      2;
        nAlphaSubCycles 1;

        MULESCorr       yes;
        nLimiterIter    3;

        solver          PBiCGStab; //GAMG PBiCG PBiCGStab smoothSolver
        preconditioner  DILU;
        tolerance       1e-11;
        relTol          0;
    }  

    "(U|T|k|omega).*"
    {
        solver          PBiCGStab; //GAMG PBiCG PBiCGStab smoothSolver
        preconditioner  DILU;
        //smoother  		DILUGaussSeidel; //DILU GAMG diagonal none
        tolerance       1e-10;
        relTol          0;        
    }
    
    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0;
    }
    
    p_rgh
    {
        solver          PBiCGStab;
        preconditioner	DILU;
        tolerance       1e-11;
        relTol          0.01;
    }

    p_rghFinal
    {
        solver          PBiCGStab;
        preconditioner	DILU;
        tolerance       1e-11;
        relTol          0;        
    }

}

PIMPLE
{
    momentumPredictor   no;
    transonic           yes;
    correctPhi          no;
    correctMeshPhi      no;
    nOuterCorrectors    3;
    nCorrectors         1;
    nNonOrthogonalCorrectors 0;

}

/*relaxationFactors
{
    equations
    {
        ".*" 1;
    }
}

// ************************************************************************* //
